# CURSO PANDAS I/O
### Trabalhando com diferentes tipos de arquivos

In [55]:
import pandas as pd

## CSV

### Lendo um arquivo CSV

In [56]:
url = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/superstore_data.csv'
dados = pd.read_csv(url)
dados.head()

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835.0,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091.0,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267.0,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0
3,1386,1967,Graduation,Together,32474.0,1,1,11/5/2014,0,10,...,0,0,0,1,1,0,2,7,0,0
4,5371,1989,Graduation,Single,21474.0,1,0,8/4/2014,0,6,...,11,0,34,2,3,1,2,7,1,0

### Lendo um arquivo CSV com separador diferente

In [57]:
url2 = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/superstore_data_ponto_virgula.csv'
dados2 = pd.read_csv(url2, sep=';')
dados2.head()

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835.0,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091.0,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267.0,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0
3,1386,1967,Graduation,Together,32474.0,1,1,11/5/2014,0,10,...,0,0,0,1,1,0,2,7,0,0
4,5371,1989,Graduation,Single,21474.0,1,0,8/4/2014,0,6,...,11,0,34,2,3,1,2,7,1,0

### Manipulações em um arquivo CSV

In [58]:
# dados_primeiras_linhas = dados.head() # 5 primeiras linhas
dados_primeiras_linhas = pd.read_csv(url, nrows=5) # 5 primeiras linhas
dados_primeiras_linhas

,Id,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Response,Complain
0,1826,1970,Graduation,Divorced,84835,0,0,6/16/2014,0,189,...,111,189,218,1,4,4,6,1,1,0
1,1,1961,Graduation,Single,57091,0,0,6/15/2014,0,464,...,7,0,37,1,7,3,7,5,1,0
2,10476,1958,Graduation,Married,67267,0,1,5/13/2014,0,134,...,15,2,30,1,3,2,5,2,0,0
3,1386,1967,Graduation,Together,32474,1,1,11/5/2014,0,10,...,0,0,0,1,1,0,2,7,0,0
4,5371,1989,Graduation,Single,21474,1,0,8/4/2014,0,6,...,11,0,34,2,3,1,2,7,1,0

In [59]:
# dados_selecao = pd.read_csv(url, usecols=['Id', 'Year_Birth', 'Income'])
dados_selecao = pd.read_csv(url, usecols=[0, 1, 4]) # selecionando colunas pelo índice
dados_selecao

         Id  Year_Birth   Income
0      1826        1970  84835.0
1         1        1961  57091.0
2     10476        1958  67267.0
3      1386        1967  32474.0
4      5371        1989  21474.0
...     ...         ...      ...
2235  10142        1976  66476.0
2236   5263        1977  31056.0
2237     22        1976  46310.0
2238    528        1978  65819.0
2239   4070        1969  94871.0

[2240 rows x 3 columns]

In [60]:
# dados_selecao.to_csv('dados_selecao.csv', index=False) # salvando o arquivo

In [61]:
url_dados_sus = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/dados_sus.csv'
dados_sus = pd.read_csv(url_dados_sus, encoding='ISO-8859-1', sep=';', skiprows=3, skipfooter=12, thousands='.', decimal=',', engine='python')
dados_sus.head()

,Unidade da Federação,2008/Jan,2008/Fev,2008/Mar,2008/Abr,2008/Mai,2008/Jun,2008/Jul,2008/Ago,2008/Set,...,2020/Jul,2020/Ago,2020/Set,2020/Out,2020/Nov,2020/Dez,2021/Jan,2021/Fev,2021/Mar,Total
0,Rondônia,1388528.39,2931283.42,1541682.52,1525314.96,1645953.84,1406150.68,3065279.01,3231494.61,3117178.63,...,11824687.13,11733307.76,10201985.14,7955139.45,9357946.29,8880836.55,9266014.59,7730597.04,11023309.47,9.964113e+08
1,Acre,902416.00,1497206.26,1794028.48,1730469.42,1819443.92,1828496.00,2511754.59,2089107.14,2275708.53,...,3915193.20,3640142.82,3391242.21,4044321.44,3276590.10,3696997.31,3715723.12,3538427.92,4077045.92,4.500485e+08
2,Amazonas,4735529.42,7118990.57,8196635.49,8259378.42,7831399.90,8477273.62,9368858.72,9352532.70,9363099.35,...,19769460.14,18059931.43,17841015.63,16408315.10,19895617.91,17765167.69,21430289.17,25917134.55,22032176.22,1.917248e+09
3,Roraima,657889.53,777939.31,718688.03,839994.39,862347.96,832440.66,996693.09,894271.18,910424.17,...,3015488.30,2826486.18,2928043.91,3090313.73,3621031.05,3454460.94,3266928.47,3519773.73,3985530.08,3.288770e+08
4,Pará,18864744.11,19553758.20,21937342.70,20842829.69,23249952.88,23240687.56,24002223.56,23341218.03,25172261.32,...,40804126.43,44385715.88,36820249.47,36965931.34,39004315.80,38015145.79,38354682.46,37688314.23,33276392.89,4.705309e+09

## XLXS

### Lendo um arquivo XLSX

In [62]:
url_xlsx = 'https://github.com/alura-cursos/Pandas/blob/main/emissoes_CO2.xlsx?raw=true'
dados_xlsx = pd.read_excel(url_xlsx)
# file = 'dados/emissoes_CO2.xlsx'
# dados_xlsx = pd.read_excel(file)
dados_xlsx.head()

,País,ISO 3166-1 alpha-3,Ano,Total,Carvão,Oléo,Gás,Cimento,Queima,Outro,Per Capita
0,Afeganistão,AFG,1750,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afeganistão,AFG,1751,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afeganistão,AFG,1752,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Afeganistão,AFG,1753,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Afeganistão,AFG,1754,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Manipulações em um arquivo XLSX

In [63]:
dados_xlsx['País'].unique()

array(['Afeganistão', 'Albânia', 'Argélia', 'Andorra', 'Angola',
       'Anguila', 'Antártica', 'Antígua e Barbuda', 'Argentina',
       'Armênia', 'Aruba', 'Austrália', 'Áustria', 'Azerbaijão',
       'Bahamas', 'Bahrein', 'Bangladesh', 'Barbados', 'Bielorrússia',
       'Bélgica', 'Belize', 'Benin', 'Bermudas', 'Butão',
       'Bonaire, Saint Eustatius e Saba', 'Bósnia e Herzegovina',
       'Botswana', 'Brasil', 'Ilhas Virgens Britânicas',
       'Brunei Darussalam', 'Bulgária', 'Burkina Faso', 'Burundi',
       'Camboja', 'Canadá', 'Cabo Verde', 'República da África Central',
       'Chade', 'Chile', 'China', 'Ilha do Natal', 'Colômbia', 'Comores',
       'Congo', 'Ilhas Cook', 'Costa Rica', 'Costa do Marfim', 'Croácia',
       'Cuba', 'Curaçau', 'Chipp', 'Republica Checa', 'Coréia do Norte',
       'República Democrática do Congo', 'Dinamarca', 'Dilandi',
       'Dominica', 'República Dominicana', 'Equador', 'Egito',
       'El Salvador', 'Guiné Equatorial', 'Eritreia', 'Estônia',
       'Etiópia', 'Ilhas Faroé', 'Estados Federados da Micronésia',
       'Micronésia (estados federados de)', 'Fiji', 'Finlândia',
       'Zona do Canal do Panamá', 'França', 'África equatorial francesa',
       'Guiana Francesa', 'Polinésia Francesa',
       'África Ocidental francesa', 'Gabão', 'Gâmbia', 'Geórgia',
       'Alemanha', 'Bonito', 'Grécia', 'Groenlândia', 'Granada',
       'Guadalupe', 'Guatemala', 'Guiné', 'Guiné-bissau', 'Guiana',
       'Haiti', 'Honduras', 'Hong Kong', 'Hungria', 'Islândia', 'Índia',
       'Indonésia', 'Iraque', 'Irlanda', 'Irã', 'Israel', 'Itália',
       'Jamaica', 'Japão', 'Jordânia', 'Cazaquistão', 'Quênia',
       'Kiribati', 'Kosovo', 'Kuwait', 'Incêndios de óleo do Kuwait',
       'Quirguistão', 'Laos', 'Letônia', 'Líbano', 'Ilhas Leeward',
       'Lesoto', 'Libéria', 'Líbia', 'Liechtenstein', 'Lituânia',
       'Luxemburgo', 'Macau', 'Macedônia do Norte', 'Madagáscar',
       'Malauí', 'Malásia', 'Maldivas', 'Mali', 'Malta', 'Ilhas Marshall',
       'Martinica', 'Mauritânia', 'Maurício', 'Mayotte', 'México',
       'Mongólia', 'Montenegro', 'Montserrate', 'Marrocos', 'Moçambique',
       'Mianmar', 'Namíbia', 'Nauru', 'Nepal', 'Holanda',
       'Nova Caledônia', 'Nova Zelândia', 'Nicarágua', 'Níger', 'Nigéria',
       'Niue', 'Noruega', 'Território palestino ocupado', 'Omã',
       'Ilhas do Pacífico (Palau)', 'Paquistão', 'Palau', 'Panamá',
       'Papua Nova Guiné', 'Paraguai', 'Peru', 'Filipinas', 'Bolívia',
       'Polônia', 'Portugal', 'Porto Rico', 'Catar', 'Camarões',
       'Coreia do Sul', 'Moldávia', 'Sudão do Sul', 'Sudão', 'Reunião',
       'Romênia', 'Rússia', 'Ruanda', 'Ilhas Ryukyu', 'Santa Helena',
       'Santa Lúcia', 'Sinta Marthes (parte holandesa)', 'Samoa',
       'São Tomé e Príncipe', 'Arábia Saudita', 'Senegal', 'Sérvia',
       'Seicheles', 'Serra Leoa', 'Cingapura', 'Eslováquia', 'Eslovênia',
       'Ilhas Salomão', 'Somália', 'África do Sul', 'Espanha',
       'Sri Lanka', 'São Cristóvão e Neves', 'St. Kitts-Nevis-Aguilla',
       'São Pierre e Miquelon', 'São Vicente e Granadinas', 'Suriname',
       'Suazilândia', 'Suécia', 'Suíça', 'Síria', 'Taiwan', 'Tajiquistão',
       'Tailândia', 'Timor-Leste', 'Togo', 'Tonga', 'Trindade eTobago',
       'Tunísia', 'Turquemenistão', 'Ilhas Turcas e Caicos', 'Tuvalu',
       'Uganda', 'Ucrânia', 'Emirados Árabes Unidos', 'Reino Unido',
       'Tanzânia', 'Estados Unidos', 'Uruguai', 'Uzbequistão', 'Vanuatu',
       'Venezuela', 'Vietnã', 'Wallis e Futuna', 'Iémen', 'Zâmbia',
       'Zimbábue', 'Transporte internacional', 'Global'], dtype=object)

In [64]:
pd.ExcelFile(url_xlsx).sheet_names

['emissoes_C02', 'emissoes_percapita', 'fontes']

In [65]:
percapita = pd.read_excel(url_xlsx, sheet_name='emissoes_percapita')
percapita.head()

,País,ISO 3166-1 alpha-3,Ano,Total,Carvão,Óleo,Gás,Cimento,Queima,Outro
0,Afeganistão,AFG,1750,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afeganistão,AFG,1751,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afeganistão,AFG,1752,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Afeganistão,AFG,1753,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Afeganistão,AFG,1754,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [66]:
fontes = pd.read_excel(url_xlsx, sheet_name='fontes')
fontes.tail()

,País,ISO 3166-1 alpha-3,Ano,Total,Carvão,Oléo,Gás,Cimento,Queima,Outro,Per Capita
63099,Global,WLD,2017,"CDIAC 2022, BP, and Sum of countries",CDIAC 2022 and BP,CDIAC 2022 and BP,CDIAC 2022 and BP,Andrew cement,CDIAC 2022 and GCP,[NONE],"CDIAC 2022, BP, Sum of countries, and UN popul..."
63100,Global,WLD,2018,"CDIAC 2022, BP, and Sum of countries",CDIAC 2022 and BP,CDIAC 2022 and BP,CDIAC 2022 and BP,Andrew cement,CDIAC 2022 and GCP,[NONE],"CDIAC 2022, BP, Sum of countries, and UN popul..."
63101,Global,WLD,2019,"CDIAC 2022, BP, and Sum of countries",CDIAC 2022 and BP,CDIAC 2022 and BP,CDIAC 2022 and BP,Andrew cement,CDIAC 2022 and GCP,[NONE],"CDIAC 2022, BP, Sum of countries, and UN popul..."
63102,Global,WLD,2020,"CDIAC 2022, BP, and Sum of countries",CDIAC 2022 and BP,CDIAC 2022 and BP,CDIAC 2022 and BP,Andrew cement,CDIAC 2022 and GCP,[NONE],"CDIAC 2022, BP, Sum of countries, and UN popul..."
63103,Global,WLD,2021,"CDIAC 2022, BP, and Sum of countries",CDIAC 2022 and BP,CDIAC 2022 and BP,CDIAC 2022 and BP,Andrew cement,CDIAC 2022 and GCP,[NONE],"CDIAC 2022, BP, Sum of countries, and UN popul..."

In [67]:
intervalo = pd.read_excel(url_xlsx, sheet_name='emissoes_C02', usecols='B:C', nrows=10)
intervalo

  ISO 3166-1 alpha-3   Ano
0                AFG  1750
1                AFG  1751
2                AFG  1752
3                AFG  1753
4                AFG  1754
5                AFG  1755
6                AFG  1756
7                AFG  1757
8                AFG  1758
9                AFG  1759

In [68]:
# percapita.to_excel('dados/percapita.xlsx', index=False)

### Leitura de planilha do Google Sheets

In [69]:
sheet_id = '1pvBoLyX8kP0TjtUbadVMGdTl4yzm6bHMThhPiqCVtpw'
url_google_sheets = f'https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet'
dados_google_sheets = pd.read_csv(url_google_sheets)
dados_google_sheets.head()

,Country Name,country_code,Region,Indicator Name,1990,1991,1992,1993,1994,1995,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,2019.1
0,Aruba,ABW,Latin America & Caribbean,CO2 emissions (metric tons per capita),NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,South Asia,CO2 emissions (metric tons per capita),191.745.115,167.681.579,95.957.742,8.472.111,75.545.827,68.467.956,...,29.650.624,259.295.334,18.562.366,146.235.617,172.896.741,149.789.334,131.694.556,1.632.953,159.824.372,159.824.372
2,Angola,AGO,Sub-Saharan Africa,CO2 emissions (metric tons per capita),553.661.955,544.538.649,543.557.223,70.898.423,836.804.405,912.141.485,...,985.522.312,950.695.879,1.036.293.852,1.099.779.111,113.504.405,1.031.811.348,81.330.073,777.674.934,792.137.069,792.137.069
3,Albania,ALB,Europe & Central Asia,CO2 emissions (metric tons per capita),1.819.541.634,124.281.022,683.699.826,638.307.036,645.355.189,605.436.253,...,166.942.319,150.324.046,1.533.630.039,1.668.337.371,160.377.515,1.557.664.358,1.788.786.074,1.782.738.948,169.224.832,169.224.832
4,Andorra,AND,Europe & Central Asia,CO2 emissions (metric tons per capita),7.521.831.658,723.537.924,69.630.787,6.724.177.518,6.541.578.914,6.733.479.486,...,5.850.886.105,5.944.654.173,5.942.800.412,5.807.127.723,6.026.181.822,6.080.600.282,6.104.133.912,6.362.975.399,6.481.217.432,6.481.217.432

In [70]:
# sheet_name = '' # nome da planilha
# url_google_sheets = f'https://docs.google.com/spreadsheets/d/{sheet_id}/gviz/tq?tqx=out:csv&sheet={sheet_name}'
# dados_google_sheets = pd.read_csv(url_google_sheets)
# dados_google_sheets.head()

In [71]:
# dados_google_sheets.to_csv('dados/dados_google_sheets.csv', index=False)

## JSON
### Lendo um arquivo JSON

In [72]:
url_json = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/pacientes.json'
dados_json = pd.read_json(url_json)
dados_json.head()

,ID_paciente,Doenca_cardiaca,IMC,Fumante,Consumo_alcool,AVC,Saude_fisica,Saude_mental,Dificuldade_caminhar,Sexo_biologico,Faixa_etaria,Raca,Diabetes,Atividade_fisica,Saude_geral,Horas_sono,Asma,Doenca_renal,Cancer_pele
0,0,Nao,16.60,Sim,Nao,Nao,3,30,Nao,Feminino,55-59,Branca,Sim,Sim,Muito boa,5,Sim,Nao,Sim
1,1,Nao,20.34,Nao,Nao,Sim,0,0,Nao,Feminino,80 ou +,Branca,Nao,Sim,Muito boa,7,Nao,Nao,Nao
2,2,Nao,26.58,Sim,Nao,Nao,20,30,Nao,Masculino,65-69,Branca,Sim,Sim,Razoavel,8,Sim,Nao,Nao
3,3,Nao,24.21,Nao,Nao,Nao,0,0,Nao,Feminino,75-79,Branca,Nao,No,Boa,6,Nao,Nao,Sim
4,4,Nao,23.71,Nao,Nao,Nao,28,0,Sim,Feminino,40-44,Branca,Nao,Sim,Muito boa,8,Nao,Nao,Nao

In [73]:
url_json_2 = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/pacientes_2.json'
dados_json_2 = pd.read_json(url_json_2)
dados_json_2.head()

,Pesquisa,Ano,Pacientes
0,Principais Indicadores de Doenca Cardiaca,2020,"{'ID': '01', 'Faixa_etaria': '55-59', 'Sexo_bi..."
1,Principais Indicadores de Doenca Cardiaca,2020,"{'ID': '02', 'Faixa_etaria': '80 ou +', 'Sexo_..."
2,Principais Indicadores de Doenca Cardiaca,2020,"{'ID': '03', 'Faixa_etaria': '65-69', 'Sexo_bi..."

### Manipulações em um arquivo JSON
#### Normalização de JSON com vários níveis (nested data/dados aninhados)

In [74]:
df_normalizado = pd.json_normalize(dados_json_2['Pacientes']) # A função normalize transforma um objeto aninhado em DataFrame
df_normalizado

,ID,Faixa_etaria,Sexo_biologico,Raça,IMC,Fumante,Consumo_alcool,Saude_fisica,Saude_mental,Dificuldade_caminhar,Atividade_fisica,Saude_geral,Horas_sono,Problemas_saude
0,01,55-59,Feminino,Branca,16.60,Sim,Nao,3,30,Nao,Sim,Muito boa,5,"[Diabetes, Asma, Cancer_pele]"
1,02,80 ou +,Feminino,Branca,20.34,Nao,Nao,0,0,Nao,Sim,Muito boa,7,[AVC]
2,03,65-69,Masculino,Branca,26.58,Sim,Nao,20,30,Nao,Sim,Muito boa,8,"[diabetes, Asma]"

#### Salvando um arquivo JSON

In [75]:
# df_normalizado.to_json('dados/pacientes_normalizado.json', orient='records', lines=True) # salvando o arquivo

#### Normalização de JSON com vários níveis com parâmetros record_path e meta

In [76]:
# #Importando o módulo JSON
# import json
# 
# #Lendo o arquivo json usando o módulo Python JSON
# with open('pacientes_2.json','r') as f:
#     dados = json.loads(f.read())
# 
# #Normalizando os dados com os parâmetros record_path e meta
# pd.json_normalize(dados, record_path='Pacientes', meta=['Pesquisa', 'Ano'])

## HTML
### Lendo um arquivo HTML

In [77]:
url_html = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/filmes_wikipedia.html'
dados_html = pd.read_html(url_html)
dados_html

[       0                      1
 0   1998             100 Movies
 1   1999              100 Stars
 2   2000             100 Laughs
 3   2001            100 Thrills
 4   2002           100 Passions
 5   2003  100 Heroes & Villains
 6   2004              100 Songs
 7   2005       100 Movie Quotes
 8   2005              25 Scores
 9   2006             100 Cheers
 10  2006            25 Musicals
 11  2007   100 Movies (Updated)
 12  2008        AFI's 10 Top 10
 13   vte                    vte,
                             Film  Release year              Director  \
 0                   Citizen Kane          1941          Orson Welles
 1                     Casablanca          1942        Michael Curtiz
 2                  The Godfather          1972  Francis Ford Coppola
 3             Gone with the Wind          1939        Victor Fleming
 4             Lawrence of Arabia          1962            David Lean
 ..                           ...           ...                   ...
 95                 The Searchers          1956             John Ford
 96              Bringing Up Baby          1938          Howard Hawks
 97                    Unforgiven          1992        Clint Eastwood
 98  Guess Who's Coming to Dinner          1967        Stanley Kramer
 99           Yankee Doodle Dandy          1942        Michael Curtiz

                       Production companies  Rank
 0                       RKO Radio Pictures     1
 1                    Warner Bros. Pictures     2
 2   Paramount Pictures, Alfran Productions     3
 3          Selznick International Pictures     4
 4                         Horizon Pictures     5
 ..                                     ...   ...
 95                  C. V. Whitney Pictures    96
 96                      RKO Radio Pictures    97
 97                     The Malpaso Company    98
 98                       Columbia Pictures    99
 99                   Warner Bros. Pictures   100

 [100 rows x 5 columns],
           hidevteAFI's 100 Years...100 Movies (1998)  \
 0  Citizen Kane (1941) Casablanca (1942) The Godf...

         hidevteAFI's 100 Years...100 Movies (1998).1
 0  Citizen Kane (1941) Casablanca (1942) The Godf...  ]

In [78]:
type(dados_html)

list

In [79]:
len(dados_html)

3

In [80]:
dados_html[0]

       0                      1
0   1998             100 Movies
1   1999              100 Stars
2   2000             100 Laughs
3   2001            100 Thrills
4   2002           100 Passions
5   2003  100 Heroes & Villains
6   2004              100 Songs
7   2005       100 Movie Quotes
8   2005              25 Scores
9   2006             100 Cheers
10  2006            25 Musicals
11  2007   100 Movies (Updated)
12  2008        AFI's 10 Top 10
13   vte                    vte

In [81]:
dados_html[1]

,Film,Release year,Director,Production companies,Rank
0,Citizen Kane,1941,Orson Welles,RKO Radio Pictures,1
1,Casablanca,1942,Michael Curtiz,Warner Bros. Pictures,2
2,The Godfather,1972,Francis Ford Coppola,"Paramount Pictures, Alfran Productions",3
3,Gone with the Wind,1939,Victor Fleming,Selznick International Pictures,4
4,Lawrence of Arabia,1962,David Lean,Horizon Pictures,5
...,...,...,...,...,...
95,The Searchers,1956,John Ford,C. V. Whitney Pictures,96
96,Bringing Up Baby,1938,Howard Hawks,RKO Radio Pictures,97
97,Unforgiven,1992,Clint Eastwood,The Malpaso Company,98
98,Guess Who's Coming to Dinner,1967,Stanley Kramer,Columbia Pictures,99
99,Yankee Doodle Dandy,1942,Michael Curtiz,Warner Bros. Pictures,100

In [82]:
dados_html[2]

,hidevteAFI's 100 Years...100 Movies (1998),hidevteAFI's 100 Years...100 Movies (1998).1
0,Citizen Kane (1941) Casablanca (1942) The Godf...,Citizen Kane (1941) Casablanca (1942) The Godf...

In [83]:
top_filmes = dados_html[1]
top_filmes.head()

,Film,Release year,Director,Production companies,Rank
0,Citizen Kane,1941,Orson Welles,RKO Radio Pictures,1
1,Casablanca,1942,Michael Curtiz,Warner Bros. Pictures,2
2,The Godfather,1972,Francis Ford Coppola,"Paramount Pictures, Alfran Productions",3
3,Gone with the Wind,1939,Victor Fleming,Selznick International Pictures,4
4,Lawrence of Arabia,1962,David Lean,Horizon Pictures,5

### Salvar em formato HTML

In [84]:
# top_filmes.to_html('dados/top_filmes.html', index=False)

### Manipulando arquivos XML

In [85]:
url_xml = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/imdb_top_1000.xml'
dados_xml = pd.read_xml(url_xml)
dados_xml.head()

,index,Poster_Link,Series_Title,Released_Year,Certificate,Runtime,Genre,IMDB_Rating,Overview,Meta_score,Director,Star1,Star2,Star3,Star4,No_of_Votes,Gross
0,0,https://m.media-amazon.com/images/M/MV5BMDFkYT...,The Shawshank Redemption,1994,A,142 min,Drama,9.3,Two imprisoned men bond over a number of years...,80.0,Frank Darabont,Tim Robbins,Morgan Freeman,Bob Gunton,William Sadler,2343110,"28,341,469"
1,1,https://m.media-amazon.com/images/M/MV5BM2MyNj...,The Godfather,1972,A,175 min,"Crime, Drama",9.2,An organized crime dynasty's aging patriarch t...,100.0,Francis Ford Coppola,Marlon Brando,Al Pacino,James Caan,Diane Keaton,1620367,"134,966,411"
2,2,https://m.media-amazon.com/images/M/MV5BMTMxNT...,The Dark Knight,2008,UA,152 min,"Action, Crime, Drama",9.0,When the menace known as the Joker wreaks havo...,84.0,Christopher Nolan,Christian Bale,Heath Ledger,Aaron Eckhart,Michael Caine,2303232,"534,858,444"
3,3,https://m.media-amazon.com/images/M/MV5BMWMwMG...,The Godfather: Part II,1974,A,202 min,"Crime, Drama",9.0,The early life and career of Vito Corleone in ...,90.0,Francis Ford Coppola,Al Pacino,Robert De Niro,Robert Duvall,Diane Keaton,1129952,"57,300,000"
4,4,https://m.media-amazon.com/images/M/MV5BMWU4N2...,12 Angry Men,1957,U,96 min,"Crime, Drama",9.0,A jury holdout attempts to prevent a miscarria...,96.0,Sidney Lumet,Henry Fonda,Lee J. Cobb,Martin Balsam,John Fiedler,689845,"4,360,000"

In [86]:
# dados_xml.to_xml('dados/imdb_top_1000.xml')

## SQL
### Manipulação de dados em um banco SQLite

In [87]:
import sqlalchemy, sqlite3
from sqlalchemy import create_engine, MetaData, Table, select, inspect

In [88]:
engine = create_engine('sqlite:///:memory:')

In [89]:
url_sql = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv'
dados_sql = pd.read_csv(url_sql)
dados_sql.head()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [90]:
dados_sql.to_sql('clientes', con=engine, index=False)

438463

In [91]:
inspector = inspect(engine)
inspector.get_table_names()

['clientes']

In [92]:
query = 'SELECT * FROM clientes WHERE Categoria_de_renda = "Empregado"'
empregados = pd.read_sql(query, con=engine) # read_sql : leitura de uma consulta
empregados

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008815,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio
4,5112956,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio
...,...,...,...,...,...,...,...,...,...,...,...
226054,6837905,43,Ensino médio,Casado,3,Empregado,Outro,7,355050.0,1,Casa/apartamento próprio
226055,6837906,43,Ensino médio,Casado,3,Empregado,Outro,7,355050.0,1,Casa/apartamento próprio
226056,6839936,34,Ensino médio,Casado,3,Empregado,Construção Civil,5,135000.0,1,Casa/apartamento próprio
226057,6840222,43,Ensino médio,Solteiro,1,Empregado,Construção Civil,8,103500.0,0,Casa/apartamento próprio
226058,6842885,51,Ensino médio,Casado,2,Empregado,Vendas,3,121500.0,0,Casa/apartamento próprio

In [93]:
empregados.to_sql('empregados', con=engine, index=False)

226059

In [94]:
pd.read_sql_table('empregados', con=engine) # read_sql_table : leitura de uma tabela

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008815,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio
4,5112956,46,Ensino superior,Casado,2,Empregado,Contabilidade,2,270000.0,1,Casa/apartamento próprio
...,...,...,...,...,...,...,...,...,...,...,...
226054,6837905,43,Ensino médio,Casado,3,Empregado,Outro,7,355050.0,1,Casa/apartamento próprio
226055,6837906,43,Ensino médio,Casado,3,Empregado,Outro,7,355050.0,1,Casa/apartamento próprio
226056,6839936,34,Ensino médio,Casado,3,Empregado,Construção Civil,5,135000.0,1,Casa/apartamento próprio
226057,6840222,43,Ensino médio,Solteiro,1,Empregado,Construção Civil,8,103500.0,0,Casa/apartamento próprio
226058,6842885,51,Ensino médio,Casado,2,Empregado,Vendas,3,121500.0,0,Casa/apartamento próprio

In [95]:
pd.read_sql_table('empregados', con=engine, columns=['ID_Cliente', 'Grau_escolaridade', 'Rendimento_anual']) # leitura de colunas específicas da tabela

        ID_Cliente Grau_escolaridade  Rendimento_anual
0          5008804   Ensino superior          427500.0
1          5008805   Ensino superior          427500.0
2          5008806      Ensino médio          112500.0
3          5008815   Ensino superior          270000.0
4          5112956   Ensino superior          270000.0
...            ...               ...               ...
226054     6837905      Ensino médio          355050.0
226055     6837906      Ensino médio          355050.0
226056     6839936      Ensino médio          135000.0
226057     6840222      Ensino médio          103500.0
226058     6842885      Ensino médio          121500.0

[226059 rows x 3 columns]

In [96]:
query = 'SELECT * FROM clientes'
pd.read_sql(query, con=engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
1,5008805,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado
2,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio
3,5008808,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio
...,...,...,...,...,...,...,...,...,...,...,...
438458,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,135000.0,0,Casa/apartamento próprio
438459,6840222,43,Ensino médio,Solteiro,1,Empregado,Construção Civil,8,103500.0,0,Casa/apartamento próprio
438460,6841878,22,Ensino superior,Solteiro,1,Associado comercial,Vendas,1,54000.0,0,Mora com os pais
438461,6842765,59,Ensino médio,Casado,2,Pensionista,Outro,0,72000.0,0,Casa/apartamento próprio
438462,6842885,51,Ensino médio,Casado,2,Empregado,Vendas,3,121500.0,0,Casa/apartamento próprio

In [103]:
query = 'SELECT * FROM clientes WHERE ID_Cliente = "5008804"'
resposta = pd.read_sql(query, con=engine)
resposta

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008804,32,Ensino superior,União-estável,2,Empregado,Outro,12,427500.0,1,Apartamento alugado

In [104]:
resposta.empty

False

In [105]:
# ESTE CÓDIGO NÃO FUNCIONA EM VERSÕES ACIMA DA 2.0 DO SQLALCHEMY
SQLALCHEMY_SILENCE_UBER_WARNING=1 # para suprimir o warning

query = 'DELETE FROM clientes WHERE ID_Cliente = 5008804' 
with engine.connect() as conn: 
    conn.execute(query)

In [109]:
query = 'SELECT * FROM clientes WHERE ID_Cliente = "5008804"'
resposta = pd.read_sql(query, con=engine)
# resposta
resposta.empty

True

In [111]:
query = 'SELECT * FROM clientes WHERE ID_Cliente = "5008806"'
pd.read_sql(query, con=engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008806,58,Ensino médio,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio

In [112]:
query = 'UPDATE clientes SET Grau_escolaridade = "Ensino superior" WHERE ID_Cliente = 5008806'
with engine.connect() as conn:
    conn.execute(query)

query = 'SELECT * FROM clientes WHERE ID_Cliente = "5008806"'
pd.read_sql(query, con=engine)

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
0,5008806,58,Ensino superior,Casado,2,Empregado,Segurança,3,112500.0,1,Casa/apartamento próprio

In [114]:
query = 'INSERT INTO clientes VALUES (5000001, 54, "Mestrado", "Casado(a)", 3, "Empregado", "Servidor(a) público(a)", 10, 150000, 1, "Studio")'
with engine.connect() as conn:
    conn.execute(query)

In [117]:
pd.read_sql('SELECT * FROM clientes', con=engine).tail()

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438458,6840222,43,Ensino médio,Solteiro,1,Empregado,Construção Civil,8,103500.0,0,Casa/apartamento próprio
438459,6841878,22,Ensino superior,Solteiro,1,Associado comercial,Vendas,1,54000.0,0,Mora com os pais
438460,6842765,59,Ensino médio,Casado,2,Pensionista,Outro,0,72000.0,0,Casa/apartamento próprio
438461,6842885,51,Ensino médio,Casado,2,Empregado,Vendas,3,121500.0,0,Casa/apartamento próprio
438462,5000001,54,Mestrado,Casado(a),3,Empregado,Servidor(a) público(a),10,150000.0,1,Studio